import {Debeskiy, Sharkanskiy, Yakshur, Kezskiy, Iarskiy, Sarapulskiy, Kambarskiy, Alnashskiy, Grahovskiy, Karakulinskiy, Malopuginskiy, Mozhginskiy, Ukamenskiy, Uwinskiy, Balezinskiy, Glazovskiy, Igrinskiy, Kiyasovskiy, Kiznerkiy, Krasnogorskiy, Seltinskiy, Siuminskiy, Vavozhskiy, Votkinskiy, Zavialovskiy} from './cooradinates'

// import type { LngLat } from '@yandex/ymaps3-types';

// interface IDisctricts {
//     name: string,
//     coordinates: LngLat[],
//     description: string
// }

export const districts = [
    { name: 'Дебёсский район', coordinates: [Debeskiy], description: `1) Район образован 15 июля 1929 года из 20 сельсоветов Дебёсской и Поломской волостей Глазовского уезда и Тыловайской волости Ижевского уезда.
    В 1935 году из состава района выделен вновь образованный Тыловайский район. 1 июня 1937 года из Дебёсского района в Игринский были переданы Русско-Лозинский и Чутырскийс/с. В 1956 году в связи с упразднением Зуринского и Тыловайского районов, в его состав были переданы часть их сельсоветов. С 1962 по 1965 годы район был временно упразднён и его сельсоветы входили в состав Кезского сельского района.
    В результате муниципальной реформы с 1 января 2006 года наделён статусом муниципального района.
    2)Площадь района составляет 1033,03 км2
    3) На территории района находится 10 поселений, 61 населенный пункт из них2 села (Дебёсы, Тыловай) и 59 деревень.
    4) Численность населения района по данным 2023 года составляет 10 804 чел.
    5) В национальный состав представлен 23 национальностями, из которых преобладающими являются удмурты, русские и татары.
    6) Административный центр — село Дебёсы.
    7) Плотность населения – 10,64 чел./км2
    8) Дебёсский район расположен в северо-восточной части Удмуртской Республики, граничит с Шарканским, Игринским, Кезским районами Удмуртской Республики и Пермским краем. 
    9) Достопримечательности Дебёсского района:
    1. Музей истории Сибирского тракта в с. Дебёсы.
    2. Восстановленный участок Сибирского тракта (единственный в Удмуртии).
    3. Свято-Троицкая церковь (1846).
    4. Сретенская церковь (1899) в д. Большая Чепца.
    5. Гора Байгурезь - "Богатая гора" с удм. Природный памятник Удмуртии. Второе название горы Бакгурезь - "Немая гора". Недалеко от села Дебёсы.
    10) По центру района с востока на запад протекает река Чепца — крупнейшая река севера Удмуртии. Помимо Чепцы, протекают её притоки — Ита, Пыхта, Медло, Ил, Ирымка и многие другие.
    11) Должность главы района занимает  Иванов Андрей Серафимович.
    ` },
    { name: 'Шарканский район', coordinates: [Sharkanskiy], description: `1)	Район образован 15 июля 1929 года из 15 сельсоветов Шарканской, Сосновской и Тыловайской волостей Ижевского уезда. В 1956 году в связи с упразднением Тыловайского района, в состав Шарканского района были переданы три его сельсовета. 1 февраля 1963 года район был ликвидирован, а его территория включена в состав Воткинского сельского района, но уже через два года 12 января 1965 года Шарканский район восстановлен.
    2)	Площадь района — 1404,49 км².
    3)	В Шарканский район входят 15 поселений и 91 населённый пункт.
    4)	Численность населения по данным за 2021 год составляет 19 289 чел.
    5)	Национальный состав района: 77,8% удмурты, 21,1 русские.
    6)	Административный центр — село Шаркан.
    7)	Плотность населения – 13,73 чел./км2
    8)	Шарканский район расположен в восточной части Удмуртской Республики, граничит на западе с Якшур-Бодьинским и Игринским районами, на севере - с Дебёсским районом, на востоке с Пермским краем и Воткинским районом, на юге – с Воткинским районом.
    9)	Достопримечательности района: 
    1.	Природный парк «Шаркан»
    2.	Резиденция Тол Бабая
    3.	Резиденция Лымы Ныл (удмуртская снегурочка)
    4.	Центр Удмуртской культуры д.Быги
    5.	Д. Мувыр – место съёмок фильма «Тень Алангасара»
    6.	Кар-гора
    7.	Сказочная поляна
    8.	Церковь Петра и Павла
    9.	Родник «Святой Покровский ключ» (святой источник Покрова Божией Матери
    10.	Памятник Победы
    11.	Краеведческий музей с. Шаркан
    10)	По территории района протекают реки – Шаркан, Ита, Вотка и другие
    11)	Должность главы района занимает Муклин Василий Геннадьевич.
    ` },
    { name: 'Якшур-Бодьинский район', coordinates: [Yakshur], description: `1) Якшур-Бодьинский район образован 15 июля 1929 года из 13 сельсоветов Сосновской, Старозятцинской и Якшур-Бодьинской волостей Ижевского уезда. 1 февраля 1963 года район был упразднён, его сельсоветы разделены между Игринским сельским, Игринским промышленным районами и городом Ижевск. 12 января 1965 года район был восстановлен, но уже в новых границах.
    В рамках организации местного самоуправления с 2005 до 2021 гг. функционировал муниципальный район. Законом Удмуртской Республики от 11 мая 2021 года муниципальный район и все входящие в его состав сельские поселения к 25 мая 2021 года был упразднены и через объединение преобразованы в муниципальный округ Якшур-Бодьинский район.
    2) Площадь района — 1780,10 км².
    3) В Якшур-Бодьинский район входит 12 муниципальных образований со статусом сельских поселений и 81 населённый пункт.
    4) Численность населения по данным за 2021 год составляет 19 719 чел.
    5) Национальный состав: русские - 55,9%, удмурты - 41,1%, татары - 1,6%.
    6) Административный центр — село Якшур-Бодья.
    7) Плотность населения 11,07 чел./км2.
    8) Якшур-Бодьинский район расположен в центре республики в 42 км от столицы Удмуртской Республики и граничит на севере с Игринским, на востоке и юго-востоке – с Шарканским и Воткинским, на юге с Завьяловским, на западе – с Увинским и Селтинским районами.
    9) Достопримечательности района: 
    1.	Скульптурная композиция на центральной площади «Якшур-Бодья — открытый дом».
    2.	Площадь славы, посвященная памяти погибшим в Великой Отечественной Войне.
    3.	Памятник Героям Гражданской войны.
    4.	Памятник участникам ликвидации последствий атомных катастроф.
    5.	Храм святителя Николая в Якшур-Бодье.
    6.	Храм Святой Троицы в Кекоране
    7.	Памятник строителям дороги «Ижевск-Балезино» рядом с с.Кекораном.
    8.	Истоки рек Иж и Вотка.	
    9.	Деревянная скульптура «Лапоть на счастье» в д.Мукши.
    10) В районе протекают 22 небольшие реки: Иж, Лоза и множество их притоков . Насчитывается около 75 больших и малых прудов, до 10 естественных озер, много родников.
    11) Должность главы района занимает Леконцев Андрей Витальевич. 
    ` },
    { name: 'Кезский район', coordinates: [Kezskiy], description: `1) Район образован 15 июля 1929 года из 23 сельсоветов Балезинской, Лыпской, Поломской и Юсовской волостей Глазовского уезда. В 1935 году из состава района выделен вновь образованный Кулигинский район. В 1956 году в связи с упразднением Кулигинского района, в состав Кезского района были переданы часть его сельсоветов. В 1962 году на основе района был сформирован Кезский сельский район, в состав которого помимо сельсоветов Кезского района вошли сельсоветы Дебёсского и Карсовайского районов. В 1965 году сельский район был расформирован и Кезский район восстановлен.
    В рамках организации местного самоуправления с 2005 до 2021 гг. функционировал муниципальный район. Законом Удмуртской Республики от 26 апреля 2021 года, муниципальный район и входящие в его состав сельские поселения к 9 мая 2021 года были преобразованы в муниципальный округ Кезский район.
    2) Площадь района — 2321,02 км².
    3) В Кезский район входят 15 муниципальных образований со статусом сельских поселений и 135 населённых пунктов.
    4)Численность населения по данным за 2021 год – 18 468 чел.
    5) Национальный состав: удмурты – 55,3%, русские – 42,9%.
    6) Административный центр — посёлок Кез.
    7) Плотность населения – 7,96 чел./км2. 
    8) Кезский район расположен на Верхне-Камской возвышенности в северо-восточной части Удмуртской Республики. Граничит с Балезинским, Игринским, Дебёсским районами Удмуртии и Пермским краем.
    9) Достопримечательности: 
    1. Исток реки Кама
    2. Русский старообрядческий музей «Истоки» в Кулиге
    3. Кездурский водопад
    4. Этнокомплекс «Живица»
    5. Родники любви «Аксак и Тынгыли»
    6. Дедушкины родники в селе Кузьма
    7. Парк «Юбилейный»
    8. Александровские горки в с. Александрово
    10) По территории района протекают реки — Кама, Лып, Пызеп и множество других.
    11) Должность Главы района занимает —Богданов Иван Олегович.
    ` },
    { name: 'Ярский район', coordinates: [Iarskiy], description: `1) Ярский район образован 15 июня 1929 года из 19 сельских советов Уканской, Ежевской и Пудемской волостей Глазовского уезда, первоначально административный центр района располагался в селе Укан, а с 1932 года переведён в посёлок Яр, который был выделен в отдельный поссовет. 23 января 1935 года из Ярского района выделен Пудемский район, который 23 ноября 1956 года был упразднён и его сельсоветы вернулись в состав Ярского района. В 1962 году Ярский район упразднён и его сельсоветы разделены между Глазовским сельским и районом и городом Глазов, в 1964 году образован Ярский сельский район, в составе 7 сельсоветов и 2 поссоветов, который в 1965 году преобразован в Ярский район.
    В рамках организации местного самоуправления с 2005 до 2021 гг. функционировал муниципальный район. Законом Удмуртской Республики от 11 мая 2021 года муниципальный район и все входящие в его состав сельского поселения к 25 мая 2021 года был упразднены и через объединение преобразованы в муниципальный округ Ярский район.
    2) Площадь района — 1524,27 км².
    3) В Ярский район входят 10 поселений и 68 населённых пунктов.
    4) Численность населения по данным за 2021 год – 11 370 чел.
    5) Национальный состав: удмурты- 54,3%, русские – 41,4%, бесермяне – 1,3%, татары – 1,2%.
    6) Административный центр — посёлок Яр.
    7) Плотность населения – 7, 46 чел./км2.
    8) Ярский район расположен в северо-западной части Удмуртской Республики. На севере и западе он граничит с Кировской областью, на востоке с Глазовским, на юге с Юкаменским районами. 
    9) Достопримечательности района:
    1.	Пудемский пруд
    2.	Исток реки Вятки
    3.	Сибирский тракт	
    4.	Свято-Троицкая церковь
    10) По центру района с востока на запад протекает река Чепца — крупнейшая река севера Удмуртии. Также по территории района протекают множество притоков Чепцы, самый крупный из которых — Лекма и на севере района находится исток реки Вятка.
    11) Должность Главы района занимает Старцев Александр Юрьевич.
    ` },
    { name: 'Завьяловский район', coordinates: [Zavialovskiy], description: `1)Завьяловский район был образован 1 июня 1937 года примерно из половины Ижевского в ходе административно-территориальной реформы по разукрупнению существующих районов. Первоначально в состав района входило 11 сельсоветов: Докшинский, Завьяловский, Ильинский, Новомартьяновский, Новочультемский, Пазелинский, Раскольниковский (Гольянский), Старокентский, Чемошурский, Ягульский и Якшурский.1 февраля 1963 года район упраздняется, а вся его территория входит в Ижевский сельскохозяйственный район. Но уже 12 января 1965 года последний разукрупняется, его административный центр переносится в Завьялово, а район переименовывается в Завьяловский.
    По состоянию на 1965 год, включал Бабинский, Гольянский, Завьяловский, Казмасский, Люкский, Подшиваловский, Среднепостольский, Старокентский, Чемошурский, Шабердинский, Юськинский, Ягульский и Якшурский сельсоветы. Согласно закону Удмуртской Республики от 28 сентября 2001 года № 43-РЗ «О статусе столицы Удмуртской Республики» Завьяловский район имеет статус «пристоличного района».
    2) Площадь района составляет 2202,82 кв. км.
    3) В район входят 19 поселений и 126 населенных пунктов
    4) Численность населения 79 930 человек
    5) Национальный состав  русские составляли 65,1%, удмурты — 28,8%, татары — 3,7%
    6) Административный центр – село Завьялово 
    7) Плотность населения 36,29 чел/кв. км
    8) Район расположен в центральной части республики и граничит с Якшур-Бодьинским районом на севере, Воткинским на северо-востоке, Пермским краем на востоке, Сарапульским районом на юго-востоке, Малопургинским на юге и Увинским на западе. Север района располагается в Центрально-Удмуртской низменности, юго-восток — на Сарапульской возвышенности, а юго-запад — на Можгинской возвышенности. 
    9) В деревне Лудорвай расположен одноимённый архитектурно-этнографический музей-заповедник под открытым небом, воссоздающий удмуртские усадьбы конца XIX века. Во время праздников Масленицы, Рождества и других здесь проводятся народные гуляния в этническом стиле.
    В селе Люк находится церковь Петра и Павла (1912 год), построенная в русско-византийском стиле. К другим примечательным церквям относятся Космо-Дамиановский храм в селе Бабино (1895 год), Покровская церковь в селе Юськи (1859 год), Спасо-Преображенская церковь в селе Ягул (1915 год).
    В селе Италмас находится дом-музей олимпийской чемпионки Г. А. Кулаковой, а в селе Люк — музей, посвящённый учёному этнографу Д. К. Зеленину.
    К объектам культуры федерального значения относится Постольское городище (или — «Кленовый мыс») (V—VIII века), находящееся в 4 км к северо-западу от села Постол.
    10) Река Кама с правым притоком Иж.
    11) Глава района – Коняшин Андрей Владимирович.
    ` },
    { name: 'Сарапульский район', coordinates: [Sarapulskiy], description: `1) Район образован 4 января 1924 года в составе Уральской области. 17 января 1934 года Уральская область была разделена на Свердловскую, Челябинскую и Обско-Иртышскую области. Постановлением ВЦИК от 7 декабря 1934 года Сарапульский район Свердловской области был отнесён к Кировскому краю.
    22 октября 1937 года ВЦИК СССР удовлетворил ходатайство ЦИК Удмуртской АССР и Кировского облисполкома о передаче Сарапульского района из Кировской области в состав Удмуртской АССР[8][9].
    По указу Президиума Верховного Совета РСФСР от 7 марта 1939 года за счёт разукрупнения Сарапульского района был образован Камбарский район. Одновременно город Сарапул получил статус города республиканского (АССР) подчинения.
    Постановлением Президиума Верховного Совета Удмуртской АССР от 8 декабря 1962 года, вместо существующего района, образован Сарапульский сельский район. Постановлением Президиума Верховного Совета Удмуртской АССР от 11 января 1965 года Сарапульский сельский район преобразован в Сарапульский район. В 1991 году центр Сарапульского района перенесен из города Сарапула в село Сигаево.
    2) Площадь района - 1877,63 км²
    3) 15 сельских поселений и 59 населенных пунктов
    4) Население – 23 842
    5) русские составляли 85,9 %, удмурты — 6,6 %, татары — 5,1 %
    6) Село Сигаево
    7) 12,7 чел./км² 
    8) Сарапульский район расположен в юго-восточной части республики. Район граничит с Каракулинским, Завьяловским, Малопургинским, Киясовским и Камбарским районами Удмуртии, на юго-западе — с Татарстаном, а на северо-востоке — с Пермским краем. Западная часть района расположена на Сарапульской возвышенности, а восточная в Камско-Бельской низменности.Промышленность Сарапульского района представлена нефтедобывающими предприятиями. Основные отрасли в сельскохозяйственных предприятиях — производство молока, мяса и зерна.
    9) 1) Дача Башенина
        2) Набережная г. Сарапула
        3) усадьба-музей «Самоварный Дом», музейно-кузнечный комплекс «Морок» и Музей истории парфюмерии.
    10) Р. Кама 
    11) Глава района - Шарафутдинов Айдар Ильсунович
    ` },
    { name: 'Камбарский район', coordinates: [Kambarskiy], description: `1) Впервые район образован 23 января 1924 года в составе Сарапульского округа Уральской области. Постановлением ВЦИК от 10 июня 1931 года Камбарскийрайон был ликвидирован, его территория была присоединена к Сарапульскому району. 22 октября 1937 года указом ВЦИК Сарапульский район передан от Кировской области в состав Удмуртской АССР. На основании Указа Президиума Верховного совета РСФСР от 7 марта 1939 года в результате разукрупнения Сарапульского района Камбарский район был образован повторно.
    Указом Президиума Верховного Совета РСФСР от 1 января 1963 года и от 5 марта 1963 года — Камбарский район был упразднён и его территория разделена между Сарапульским сельским районом и городом Сарапул. Указом Президиума Верховного Совета РСФСР от 30 декабря 1966 года Камбарский район образован в третий и последний раз.
    2) Площадь - 672,62 км²
    3) 1 городское, 7 сельских поселений и 21 населенный пункт
    4) 16 114
    5)  русские — 92,9 %, татары — 3 %, удмурты — 1,7%
    6) Камбарка
    7) 23,96 чел./км²
    8) Район расположен в юго-восточной части республики и граничит с Сарапульским районом, на серверо-востоке — с Пермским краем, на юго-востоке — с республикой Башкортостан и на юге — с Каракулинским районом Удмуртии. Район расположен в Камско-Бельской низменности. 
    9)На территории района расположено несколько памятников природы, в частности, Камбарское и Михайловское болота, Камская грива и Шольинский.
    10)Западная граница района проходит по реке Кама и по территории района протекают её притоки — Армязь, Шолья, Камбарка, Буй, Чёрная.
    11) Глава района - Галанов Александр Николаевич
    ` },
    { name: 'Каракулинский район', coordinates: [Karakulinskiy], description: `1) Впервые Каракулинский район был образован в октябре 1923 года как экспериментальный, но уже в следующем 1924 году ликвидирован. 4 ноября 1926 года район образован повторно в составе Вятской губернии. В конце 1931 года район снова ликвидирован и объединëн с Сарапульским районом в составе Нижегородской области. В феврале 1935 года Каракулинский район образован в третий раз в составе Кировскойобласти.22 октября 1937 года район из Кировской области передан в состав Удмуртской АССР.С 1963 года по 1965 годы Каракулинский район в очередной раз ликвидирован и его территория входила в состав Сарапульского сельского района[8]. На основании Указа Президиума Верховного Совета УАССР от 12 января 1965 года район был снова образован, как самостоятельная территориальная единица.
    2) 1192,56 км²
    3) 12 сельских поселений и 32 населенных пункта
    4) 10 471
    5)  русские составляли 75,3 %, марийцы — 16,7 %, удмурты — 3,7 %, татары — 2,8 %
    6) Каракулино
    7) 8,78 чел./км²
    8) Район расположен в юго-восточной части республики и граничит: на юге и западе с Республикой Татарстан, на востоке — с Республикой Башкортостан, на севере — с Сарапульским районом Удмуртской Республики. Район расположен на Сарапульской возвышенности. Ведущую роль в промышленном комплексе района занимает добыча полезных ископаемых, на долю которой приходится более 99 % от всей промышленности района. Каракулинский район является самым крупным нефтедобывающим районом республики. Около 25 процентов всей добычи нефти в республике осуществляется на территории этого района.
    9) Спасский храм (1880)  с. Новопоселенное
    Природный парк "Усть-Бельск"
    Чегандинские пещеры в парке "Усть-Бельск"
    Часовня Николая Чудотворца в с. Каракулино
    Зуевоключевской, Чегандинский городища, Ныргындинский могильник. 
    10) Восточная граница района проходит по реке Кама и по территории района протекают её притоки — Большая Емаша, Кобылка, Буториха и множество других.
    11) Глава района - Белёвцев Михаил Николаевич
    ` },
    { name: 'Юкаменский район', coordinates: [Ukamenskiy], description: `1) Юкаменский район образован 15 июля 1929 года из 17 сельсоветов Юкаменской, Ежевской и Курьинской волостей Глазовского уезда[5]. В 1931 году ему переданы сельсоветы ликвидированного Святогорского района.В январе 1935 года из состава Юкаменского района выделен Святогорский район. В 1963 году Юкаменский район упразднен, его территория вошла в состав Глазовского сельского района. 3 января 1967 года район был восстановлен.
    2) 1016,09 км²
    3) 8 сельских поселений и 73 населенных пункта
    4) 7574 чел
    5) удмурты составляли 45,1 %, русские — 27 %, татары — 16,9 %, бесермяне — 10,6 %
    6) с. Юкаменское 
    7) 7,45 чел./км² 
    8) Район расположен в северо-западной части Удмуртской Республики, на Красногорской возвышенности, граничит с Ярским, Глазовским и Красногорским районами, а также Кировской областью.Промышленность на территории Юкаменского района представлена муниципальным унитарным предприятием «Юкаменский льнозавод».
    9) Кедрова роща в Пыштет (кедрам 40-70 лет)
    Музей бесермянской культуры в с. Пыштет
    Мемориальный комплекс участникам Гражданской и Великой Отечественной войн в с. Юкаменское
    Музей льна в с. Юкаменское
    Музей хлеба в с. Юкаменское
    Музей татарской культуры в д. Починки
    Историко-краеведческий музей в д. Палагай
    10) По территории района протекают реки Лекма, Лема, Убыть
    11) Глава района - Бельтюков Константин Николаевич
    ` },
    { name: 'Граховский район', coordinates: [Grahovskiy], description: `1) Граховский район образован постановлением Президиума ВЦИК от 15 июля1929 года из сельсоветов Граховской, Троцкой и части Билярского сельсовета Можгинскойволости Можгинского уезда, в состав нового района вошли 21 сельсовет. В1935 году на части территории Граховского района, образован самостоятельныйБемыжский район, в состав которого вошли все 10 сельсоветов ранее ликвидированной Троцкой волости. 27 ноября 1956 года Бемыжский район упразднён и к Граховскому району отошли Крымско-Слудский и Старо-Ятчинский сельсоветы. 1 февраля1963 годаГраховский район расформирован и входит в состав Кизнерского района. Но уже через два года 22 октября 1965 года Граховский район восстановлен. В 1965 годудеревниУдмурт-Сарамак и Русский Сарамак Староятчинского сельсовета были переданы в состав Крымско-Слудского сельского Совета Кизнерского района, после этого внешние границы района не менялись.
    2) Площадь района составляет 970,58 км².
    3) На территории района находится 8 сельских поселений, 41 населенный пункт из них 4 села (Верхняя Игра, Грахово, Новогорское) и 37 деревень.
    4) Численность населения района на 1 января 2023 года составила 8699 чел.
    5) По результатам переписи 2020 года, среди населения района русские составляли 50,6 %, удмурты — 31,8 %, марийцы — 10,9 %, кряшены — 3,6 %, чуваши — 1,9 %[26]. Граховский район считается уникальной окраиной республики, где соседствуют места компактного проживания пяти разных народов. Коренным народом района считаются удмурты.
    6) Административный центр — село Грахово.
    7) Плотность населения – 9,07 чел./км2
    8) Граховский район расположен на юго-западе республики, граничит с Кизнерским районом на западе, Можгинским — на севере, Алнашским — на востоке и республикой Татарстан на юге.
    9) Достопримечательности Граховского района:
    •	Граховский конезавод
    •	Музей первой удмуртской поэтессы Ашальчи Оки
    •	Центр чувашской культуры в д. Благодатное
    •	Центр русской культуры в д. Котловка
    •	Городище Каргурезь в д. Старая Игра
    •	Краеведческий музей в д. с. Верхняя Игра
    •	Центр кряшенской культуры
    •	Христорождественская церковь (1850) вс. Грахово, Колпаково ул., 16 - объект культурного наследия регионального значения. Принят под охрану по Пост. Правительства УР от 30.09.02г. № 802
    •	Останки помещечьей усадьбы в с. Заречный
    •	Сквер имени Ашальчи Оки в д. Порым, архитектор Галиханов К.Ш., Погодин С.П
    •	Часовня отца Михаила (М.Г. Атаманова) - переводчика священных писаний на удмуртский язык
    •	Дом-музей Бельского П. И. - полного кавалера орденов Славы
    •	Центр кряшенской культуры в д. Полым
    •	Пророко-Ильинская церковь (1858) в с. Новогорское
    •	Резиденция Бабы Яги
    10) По территории района протекают реки: Умяк, Большой Сырян, Яга, Адамка, Кузебайка, Юрашка (приток Тоймы), Юрашка (приток Адамки), Юраш, Сайка, Возжайка, Кокшанка, Тыловайка и Ерыкса, Улек.
    11) Глава района —Крестьянинов Михаил Арсентьевич
    ` },
    { name: 'Алнашский район', coordinates: [Alnashskiy], description: `1) Впервые населённые пункты современного Алнашского района упоминаются в Ландратской переписи 1716 года в составе сотни Андрея Байтемирова Арской дороги Казанского уезда. 11 сентября 1780 года был издан высочайший указ об открытии Вятского наместничества. Вновь образованное наместничество было разделено на 13 уездов, в том числе был создан Елабужский уезд, в состав которого вошла территория современного района. Позднее в результате реформы 1796 года уезд был разделён на волости, границы волостей регулярно менялись образовывались новые. В 1921 году в связи с образованиемВотской АО в северной части упразднённого Елабужского уезда, образованМожгинский уезд. В 1924 году при укрупнении административных единиц образованы укрупнённые Алнашская и Большекибьинская волости.
    2) Площадь района составляет 896,00 км2
    3) На территории района находится 12 бывших сельских поселений, 81 населенный пункт из них 5 сёл (Алнаши, НижнееАсаново, Варзи-Ятчи, Асановский совхоз-техникум) и 59 деревень.
    4) Численность населения района на 1 января 2023 года составила 20 182 чел.
    5) По результатам переписи 2020 года (из числа лиц, указавших национальность),удмурты составляли 82,7 %, русские — 12,2 %, татары — 2,4 %, марийцы — 2 %. Алнашскийрайон один из 12 сельских районов республики, где удмурты составляют большинство, а также один из трёх районов компактного проживания марийцев. Также в Алнашском районе наблюдается самая высокая доля удмуртского населения среди районов республики.На территории Алнашского района существовала сельская еврейская община.
    6) Административный центр — село Алнаши.
    7) Плотность населения – 22,52 чел./км2
    8) Район граничит с Граховским районом на западе, Можгинским — на севере, а также с республикой Татарстан, Агрызским районом — на востоке и Менделеевским — на юго-западе.
    9) Достопримечательности:
    1. Памятники природы:
    	Санаторий "Варзи-Ятчи" - уникальная грязевая лечебница. Основана в XIX .
    	Северный торфяник Варзи-Ятчинских лечебных минеральных грязей.
    	Южный торфяник Варзи-Ятчинских лечебных минеральных грязей.
    	Кузебаевский торфяник лечебных минеральных грязей.
    	Муважинский торфяник лечебных минеральных грязей.
    	Варзибашский торфяник лечебных минеральных грязей.
    	Варзино-Алексеевский торфяник лечебных минеральных грязей.
    	Родник Ильинский в деревне Ильинское.
    	Родник "Мощный" в районе дер. Рождественское.
    	Речка Карашурка - нерестилище ручьевой форели.
    	Нижне-Сырьезское урочище - разнообразие видового состава трав.
    2. Памятные места:
    	Место бывшего села Голюшурма. Поселение было образовано купцом Стахеевым в XIX в. Снесено в конце 60-х годов XX в.
    	Тыловось - место языческого моления удмуртов в районе деревни УдмуртскийТоймобаш.
    	Булдавось - место языческого моления удмуртов в районе деревни Кузебаево.
    	Кереметвось - место языческого моления удмуртов в районе деревни Кузебаево.
    	Булдавось - место языческого моления удмуртов в районе деревни Пирогово.
    	Плотина медного завода - в районе деревни Варзино-Алексеево.
    	Тополя Трофима Борисова - в районе д. Кизеково.
    	Тополя Филиппа Кедрова - в районе бывшей д. Силе (выселок Луч).
    	Ключ Ашальчи Оки в районе райбольницыв с. Алнаши.
    	Ключ Николая Байтерякова в районе с. Варзи-Ятчи.
    3. Исторические захоронения:
       Могила первой удмуртской поэтессы Ашальчи Оки (Лины Григорьевны Векшиной) / 1898 - 1973 /, кладбище с. Алнаши.
       Могила народного поэта Удмуртии Германа Алексеевича Ходырева/1932- 1995/.
    4. Памятники зодчества:
    	Свято-Троицкий храм 1836 г. Школа классицизма в с. Алнаши.
    	Свято-Никольский храм в с. Варзи-Ятчи.
    	Деревянная церковь в с. Ключевка.
    	Деревянная мечеть в д. ТатарскийТоймобаш.
    5. Памятники народного /деревянного/ зодчества :
    	Деревянная ветряная мельница в д. Шадрасак-Кибья XIX в.
    	Крестьянская изба Дмитриевых в д. Кузебаево XIX в.
    	Крестьянская изба Сперанских в д. МуважиХГХв.
    	Дом священника в с. Алнаши, Садовая, 4 XIX в.
    6. Южный берег Удмуртии.
    10) Район располагается в бассейне Камы, южная граница района проходит по берегуНижнекамского водохранилища. По территории района протекают реки – Варзи,Тойма,Алнашка, Варали, Варага, Утчанка и множество других. Среднегодовые модули стока рек 4,5-5,0 л/сек*км², плотность речной сети — 0,58 км/км.
    11) Глава района —Семёнов Алексей Викторович.
    ` },
    { name: 'Можгинский район', coordinates: [Mozhginskiy], description: `1) Можгинский район образован 15 июля 1929 года из 24 сельсоветов Большекибьинской, Большеучинской, Можгинской и Троцкой волостей Можгинского уезда. На момент создания на территории района проживало 46 126 человек. В 1932 году в связи с ликвидацией Нылги-Жикьинского района часть его сельсоветов передана в состав Можгинского района. В 1937 году при разукрупнении района выделились два новых:Пычасский и Большеучинский. В 1956 году Бемыжский, Пычасский и Большеучинский районы упразднены и район снова расширяется. В результате административно-территориальной реформы 1963 года Можгинский, Алнашский и часть сельсоветовВавожскогорайонов объединены в Можгинский сельский район, а город Можга выделен в самостоятельную административную единицу — город республиканского подчинения. Спустя два года, в 1965 году, в результате очередной реформы Вавожский и Алнашский районы восстановлены и Можгинский район приобрёл современные границы.
    2) Площадь района – 1996,97 км².
    3) На территории района находится 12 бывших сельских поселений, 81 населенный пункт из них 5 сёл (Алнаши, Нижнее Асаново, Варзи-Ятчи, Асановский совхоз-техникум) и 59 деревень.
    4) Численность населения по данным за 2021 год составляет 25 265 чел.
    5) Национальный состав: русские – 40 %, удмурты –54,5 %, татары –2,6 %.
    6) Административный центр — город Можга.
    7) Плотность населения 12,56 чел./км2.
    8) Район расположен в юго-западной части республики вокруг города Можга и граничит с Увинским районом на севере, Малопургинским на востоке, республикой Татарстан и Алнашским районом на юго-востоке, Граховским на юго-западе,Кизнерским на западе и Вавожским на северо-западе.
    9) Достопримечательности Можгинского района:
    1. Исток реки Вала.
    2. Свято-Никольский храм (1862) в с. Поршур.
    3. Дом-музей и родник Веры Толстой в д. Боль.Сибы, родственницы Льва Тостого.
    4. Памятник трактору Фордзон в д. Александрово.
    5. Памятник восьми братьям Сидоровым в д. Малая Сюга, погибшим в ВОВ.
    6. Родина маршала авиации Фалалеева Ф.Я. в д. Полянское.
    7. Церковь Введения в храм Пресвятой Богородицы (1902) в с. Нынек.
    8. Казаско-Богородицкий храм (1754) в с. Можга.
    9. Храм Святой Троицы (1837) в с. Большая Уча.
    10. Александро-Невская церковь (1890) в с. Русский Пычас.
    11. Храм Святого апостола Андрея Первозванного в с. БольшаяПудга.
    12. Казанско-Богородицкий молитвенный дом  в с. БольшаяКибья.
    13. Владимирский молитвенный дом в пос. Пычас.
    10) Самая крупная река в районе – Вала, приток реки Кильмезь. Общая ее длина 196 км., половина которой приходиться на Можгинский район. Реки меньшего порядка – Ныша, Сюгинка, Сюгаилка, Пошурка, Пычас, Сарсак, Юринка и т.д. важное хозяйственное, рыбоводное, противопожарное значение имеют пруды. К значительным по площади прудам следует отнести Кинеусьский, Малосюгинский, Каксинский, Учинский, Большепудгинский, Нынекский.
    11) Глава района —Васильев Александр Геннадьевич
    ` },
    { name: 'Малопургинский район', coordinates: [Malopuginskiy], description: `1) В 1929 году, после очередных изменений в административно-территориальном делении, вместо уездов и волостей были образованы ёросы (районы). Малопургинский район с центром в селе Малая Пурга образован 15 июля 1929 года из сельсоветов Бурановской и Советской волостей Ижевского уезда и Больше-Кибьинской волости Можгинского уезда. В состав района вошли 12 сельсоветов: Аксакшурский, Бобья-Учинский, Большенорьинский, Гожнинский, Ильинский, Кечурский, Малопургинский, Нижнеюринский, Пуро-Можгинский, Пытцамский, Среднекечевский и Старомоньинский и 168 населённых пунктов. В 1931 году в состав района были дополнительно переданы ещё 6 сельсоветов из ликвидированного Ижевского района, но уже в 1934 году Ижевский район восстановлен и все сельсоветы возвращены в его состав[9]. В 1935 году Большенорьинский и Среднепостольский сельсоветы переданы в состав Нылгинского района.
    В ночь на 3 июня 2011 года на военном арсенале близ посёлка Пугачёво-Малопургинского района произошли взрывы и пожар. В результате ЧП пострадало около 100 человек; было повреждено 2889 домов в 32 населённых пунктах. Нанесённый ущерб оценён в 1 млрд рублей.
    2) Площадь района — 1223,18 км².
    3) В Малопургинский район входят 15 бывших сельских поселений, 79 населенный пункт из них 6 сёл (Ильинское, Кечево, Малая Пурга, Норья, Уром, Яган), 2 посёлка (Пугачёво и Яган-Докья) и 71 деревень.
    4) Численность населения района на 1 января 2021 года составила 31 706 чел.
    5) Национальный состав по данным переписи 2020 года: русские – 25,5%, удмурты –70,2 %, татары –2,7 %.
    6) Административный центр — село Малая Пурга.
    7) Плотность населения – 25,92 чел./км2. 
    8) Район расположен в южной части республики и граничит сМожгинским районом на западе, Увинским на северо-западе, Завьяловским на севере, Сарапульским, на востоке, Киясовским на юго-востоке и республикойТатарстан на юго-западе.
    9) Достопримечательности Малопургинского района.
    •	Музей классика удмуртской литературы Семёна Самсонова
    •	Места съёмок первого художественного фильма в Удмуртии
    •	Мало-Диеевский Серафимовский женский монастырь
    •	Ансамбль "Бурановские бабушки"
    10) По району протекают реки Яганка, Кечёвка, Агрызка, Лудзинка, Постолка, Бобинка, БольшаяСарапулка, Иж. Весеннее половодье всех рек на территории района начинается обычно в середине апреля.
    11) Глава района —Александр Алексеевич Деев.
    ` },
    { name: 'Увинский район', coordinates: [Uwinskiy], description: `1) Район образован постановлением президиума областного исполнительного комитета от 8 января 1935 года, в результате разукрупнения Селтинскогои Вавожского районов. 10 июля 1935 года райцентру был присвоен статус посёлка городского типа. В 1962 году район был разделён на Увинский промышленный и Увинский сельский районы, и в период с 1963 по 1965 годы в состав Увинского сельского района входили части временно упразднённых Селтинского и Вавожского районов. В 1965 году Увинский сельский и промышленный районы снова объединены в один — Увинский район.
    В рамках организации местного самоуправления с 2005 до 2021 гг. функционировалмуниципальный район. Законом Удмуртской Республики от 17 мая 2021 года муниципальный район и все входящие в его состав сельские поселения через объединение к 30 мая 2021 года преобразованы муниципальный округ Увинский район.
    2) Площадь района — 2445,37 км².
    3) В Увинский район входят 17 сельских поселений, 89 населенный пункт из них 11 сёл (Булай, Каркалай, Красное, Кыйлуд, Мушковай, Новый Мултан, Нылга, Сям-Можга, Удугучин, Чекан), посёлкУва и 77 деревень.
    4) Численность населения района на 1 января 2021 года составила 34 627 чел.
    5) Национальный состав по данным переписи 2020 года: русские – 63,2%, удмурты – 34,2 %, татары – 1,4 %.
    6) Административный центр — посёлок Ува.
    7)Плотность населения – 14,16 чел./км2.
    8) Район расположен в центральной части республики и граничит сВавожским,Сюмсинским, Селтинским, Якшур-Бодьинским, Завьяловским,МалопургинскимиМожгинскимрайонами.
    9) Достопримечательности Увинского района.
       Санаторий "Ува"
       Священная сосна у д. Чабишур. Возраст приближается к четырём векам
       Дом ремёсел и родник в Узей-Тукле
       "Крыша Удмуртии" - Кабангурезь, самая возвышенная часть района, вторая по высоте точка Удмуртии. Здесь же находиться географический центр Удмуртии
       Храм Михаила Архангела в с. Сям-Можга
       Церковь Александра Невского в в с. Удугучи
    10) По территории района протекают реки Арлеть, Какмож, Мушковай, Поливай и другие. Наиболее крупные реки – Нылга и Ува, правые притоки реки Валы, которые протекают преимущественно в юго-западном направлении. Общая протяжённость реки Ува -112 км, в том числе в границах района – 70 км.
    11) Глава района — Головин Владимир Анатольевич.
    ` },
    { name: 'Красногорский район', coordinates: [Krasnogorskiy], description: `1)	История образования
    Красногорский район Удмуртской Республики был образован 10 июля 1938 года. Старое название районного центра — село Святогорье, оно было образовано в 1837 году. 15 июля 1929 года был образован Святогорский район, но уже 1 января 1932 года он был ликвидирован, а территория района включена в состав Юкаменского района. 8 января 1935 года Святогорский район вновь образован и в этом же году переименован в Барышниковский район. 10 июля 1938 года район получил новое название — Красногорский район.  Районный центр - село Красногорское - стоит на возвышенности /красной горе/, отсюда и название села.
    2)	Площадь района - 1868,7 кв.км.
    3)	Муниципальное образование «Красногорский район» включает в себя 71 населённый пункт: 10 сельских поселений в составе 8 сёл и 63 деревень.
    4)	Численность населения на 1 января 2023 года – 7584 человек. 
    5)	Национальный состав: русские 59,8%, удмурты 36,2%, татары 1,4%, украинцы 0,2%. 
    6)	Административный центр – село Красногорское. 
    7)	Плотность населения: 4 чел/кв.км. 
    8)	Общая характеристика: Красногорский район расположен в северо-западной части Удмуртской Республики, граничит с Юкаменским, Глазовским, Балезинским, Игринским, Селтинским районами Удмуртской Республики и Унинским районом Кировской области. На территории района имеются небольшие месторождения нефти, месторождения торфа, запасы стекольного песка, строительных песка и песчано-гравийной смеси, кирпичных суглинков. Имеются уникальные природные комплексы, где произрастают редкие виды растений и обитают редкие представители животного мира. Район преимущественно сельскохозяйственный. 
    9)	Достопримечательности: Храм Покрова Пресвятой Богородицы (с. Красногорское), Лиственница Сибирская (с. Кокман), Монумент Вечной Славы (с. Красногорское), Памятник труженикам тыла и детям войны (с. Красногорское). Памятник Герою Советского Союза Черезову Аркадию Степановичу (с. Валамаз). 
    10)	Водные объекты: самые длинные реки – Пестерь, Вью, Кильмезь. Самые короткие реки – Речка, Юнда. 
    11)	Глава района – Дмитрий Сергеевич Клабуков. 
    ` },
    { name: 'Селтинский район', coordinates: [Seltinskiy], description: `1)	История образования
    Согласно архивным документам, первое поселение на месте нынешнего села возникло в конце XVI века. Взятие Казани и разгром Казанского ханства войсками Ивана Грозного в 1552 году не избавили удмуртские племена от притеснений и грабежей татарских князей, сопровождавшихся, как правило, сожжением поселений и истреблением их жителей. Удмурты были вынуждены покидать обжитые места и искать спасения в бескрайних дебрях лесов. Именно к этому времени и относится появление первого поселения на территории современного села Селты. Начиная с 1610 года, в переписных царских листах появляется упоминание о поселении «Сельты». Именно так, с мягким знаком в своем названии, село впервые вошло в историческую летопись Селтинского района. Статус села поселение получило после постройки здесь каменной церкви в 1871 году.
    Селтинская волость образовалась в 1802 году. С 1797-го и до конца XVIII века она входила в состав уездов Вятской губернии. Селтинский район образован 15 июля 1929 года в составе 21 сельсовета, 331 населенного пункта. Районный центр – село Селты.
    2)	Площадь района составляет 1883,74 кв.км.
    3)	Муниципальное образование «Селтинский район» включает в себя 72 населённых пунктов: 9 сельских поселений в составе 7 сёл, 59 деревень, 2 починка и 4 выселка. 
    4)	Численность населения на 1 января 2023 года – 10457 человек. 
    5)	Национальный состав: 
    6)	Административный центр – село Селты. 
    7)	Плотность населения: 5,6 чел/кв.км. 
    8)	Общая характеристика: Район расположен в западной части Удмуртской Республики и граничит с Игринским, Красногорским, Сюмсинским, Увинским районами и Кировской областью. В районе нет разведанных запасов нефти и других полезных ископаемых. Из общераспространенных ископаемых, которые можно использовать, имеются известь, торф, гравий, щебень. Основа специализации экономики - производство и переработка сельскохозяйственной продукции, переработка лесных ресурсов.
    9)	Достопримечательности: Удмуртский питомник западносибирских лаек, Вознесенская церковь (с. Узи), Памятный камень писателю А.Н. Радищеву, Свято-Троицкая церковь с. Валамаз, участок Сибирского тракта, сосна у д. Егоровцы. 
    10)	Водные объекты: по территории района протекают 34 речки, 60 родников. Самая многоводная и самая быстрая река, протекающая по территории Селтинского района и любимое место отдыха селтинцев – река Кильмезь. По оценке экологов, это самая чистая река во всем Приуралье. В поймах рек Арлеть, Кильмезь, Уть образовались озера, их площадь 28 га.
    11)	Глава района – Василий Андреевич Протопопов. 
    ` },
    { name: 'Сюмсинский район', coordinates: [Siuminskiy], description: `1)	История образования
    Образовался район 15 июля 1929 года. Районный центр — село Сюмси.
    Большинство селений района были основаны в 18–19 веках, а некоторые даже в ХХ веке. Исключение составляет, пожалуй, только село Сюмси. Как пишет М. Г. Атаманов в «Истории Удмуртии в географических названиях» Сюмси старше всяких переписей! А ведь самая первая перепись, которая известна, проводилась в 1615 году. О значении слова «Сюмси» в свое время было много предположений, но сейчас все сошлись в том, что «сюм» — это залив, затон, а «си» — река, водный источник. Дословно Сюмси — река, вытекающая из залива (М. Г. Атаманов, 1997 г.). Применительно к населенному пункту это будет означать, что он стоит в месте, где река вытекает из залива. Район был образован из 20 сельских Советов. В дальнейшем неоднократно менялись границы района, количество и название сельсоветов. В настоящее время в Сюмсинском районе 8 сельских поселений — муниципальных образований.
    2)	Площадь района - 1782 кв. км.
    3)	Муниципальное образование «Сюмсинский район» включает в себя 56 населённых пунктов: 8 сельских поселений в составе 7 сёл, 47 деревень и 2 станции.
    4)	Численность населения на 1 января 2023 года – 10209 человек.
    5)	Национальный состав: удмурты 55,3%, русские 42,7%, татары 0,5%, армяне 0,3%. 
    6)	Административный центр – село Сюмси. 
    7)	Плотность населения: 5,7 чел/кв.км. 
    8)	Общая характеристика: Сюмсинский район находится в западной части Удмуртской Республики, граничит с Увинским, Селтинским, Вавожским районами и Кировской областью. В районе сравнительно бедные запасы естественных ресурсов. Среди ресурсов, имеющих промышленное значение, выделяется торф, минерально-строительное сырье, песчано-гравийная смесь, глина, песок.
    9)	Достопримечательности: крайняя Западная точка Удмуртской Республики, Бабьинские горы, Пумсинский мост, Чёртово озеро, Храм иконы Казанской Божией Матери (с. Сюмси), Васькинский национально-культурный центр (д. Васькино). 
    10)	Водные объекты: Святой источник у д. Малые Сюмси, наиболее крупные реки – Кильмезь, Лумпун, Инга. 
    11)	Глава района – Владимир Ильич Семенов. 
    ` },
    { name: 'Вавожский район', coordinates: [Vavozhskiy], description: `1)	История образования
    На территорию Вавожского района люди пришли примерно десять тысяч лет назад. Одно из первых официальных упоминаний о Вавоже относится к 1716 году. В начале XIX века была сформирована волость, центром которой стал Вавож. В ее состав вошла северная часть современного Вавожского района. Крестьяне, живущие в северных волостях Малмыжского уезда, не испытали на себе ужасов крепостнического права. Здесь не было помещиков, местный крестьянин мог спокойно трудиться, зная, что его не продадут, не разлучат с семьей. Удаленность от Камских заводов спасла их от приписки к ним.  Но полностью избежать тягот подневольного труда на заводах не удавалось, зачастую они вынуждены были выполнять работы для них: валить лес, выжигать уголь, заготавливать ружейную болванку для прикладов.  
      С образованием Вотской автономной области Вавожская волость вошла в состав Можгинского уезда. В 1924 году в результате объединения Вавожской, Водзимоньинской и Ува-Туклинской волостей образован Вавожский волостной район. В 1929 году были ликвидированы уезды, волостные районы укрупнялись и преобразовывались в административные районы. В Вавожский район, образованный 15 июля 1929 года, вошли территории шести бывших волостей Малмыжского уезда.   
   2)	Площадь района - 1679 кв.км.
   3)	Муниципальное образование «Вавожский район» включает в себя 69 населённых пункта: 10 сельских поселений в составе 8 сёл, 59 деревень и 2 станций. 
   4)	Численность населения на 1 января 2023 года – 13827 человек. 
   5)	Национальный состав: 56% удмурты, 40% - русские, 4% - другие национальности.
   6)	Административный центр – село Вавож. 
   7)	Плотность населения: 8,2 чел/кв.км. 
   8)	Общая характеристика: Территория района на юге и юго-западе граничит с Кизнерским, на северо-западе — с Сюмсинским, на севере, северо-востоке и востоке — с Увинским, на юго-востоке — с Можгинским районами Удмуртской Республики, на западе — с Кильмезским районом Кировской области.В Вавожском районе велась добыча торфа на четырех месторождениях, самыми крупными из них были Нюрдор-Котьинское и Ингинское. Имеются небольшие месторождения нефти (Шурминское) и азотного газа (Вавожское), а также строительных материалов — кирпично-черепичных глин и песчано-гравийных материалов, которые используются для районных нужд.
   9)	Достопримечательности: Дом-музей Кузебая Герда (д. Гурезь-Пудга), Свято-Никольский храм (с. Вавож), Храм Вознесения Господня (с. Водзимонье), Нюрдор-Кодьинские кедры.
   10)	Водные объекты: наиболее крупные реки – Вала, Кылт, Ува. 
   11)	Глава района – Сергей Викторович Зорин. 
   ` },
    { name: 'Кизнерский район', coordinates: [Kiznerkiy], description: `1)	История образования
    В 1914 началось строительство железной дороги Казань-Екатеринбург. А в 1915 году в местности, где располагается нынешний поселок Кизнер, уже был построен вокзал, появились два первых жилых дома, заложена водокачка на р. Люга и водонапорная башня. Первый поезд прошел через Кизнер весной 1916 года. В 1919-1920 г.г. была построена первая улица, получившая название в честь установления Советской власти: Советская. Из 25 сельских районов Удмуртии Кизнерский район самый молодой. 24 января 1939 года вышел Указ Президиума Верховного Совета РСФСР об образовании Кизнерского района в составе Удмуртской АССР. В состав вновь образованного района вошло 16 сельских Советов, главным образом из Вятскополянского и Малмыжского районов. Районным центром стало село Кизнер. Указом Президиума Верховного Совета РСФСР от 2 октября 1942 года райцентр переведен в поселок Кизнер и отнесен к категории рабочих поселков.
    2) Площадь района - 2,1 тыс.кв.км.
    3) Муниципальное образование «Кизнерский район» включает в себя 75 населённых пункта: 14 сельских поселений в составе 1 посёлка, 8 сёл, 61 деревни, 3 починков, 1 станции и 1 населённого пункта, не имеющего специального статуса.
    4) Численность населения на 1 января 2023 года – 17595 человек. 
              5) Национальный состав: русские 48%, удмурты 44%, татары 7%; марийцы, армяне, украинцы 1%. 
              6) Административный центр – село Кизнер. 
              7) Плотность населения: 8,4 чел/кв.км. 
    8) Общая характеристика: Кизнерский район расположен на юго-западе Удмуртской Республики. Граничит с Вавожским, Можгинским, Граховским районами Удмуртии, на юго-западе - с Республикой Татарстан и Кировской областью.
    9) Достопримечательности: родник «Живой ключ» (в 27 км к северо-востоку от Кизнера), Пандемские кедровые сосны, Черный тополь (Осокорь), Абатские пещеры. 
    10) Водные объекты: Район расположен в пойменной части Камского бассейна. В малонаселённых частях района протекают экологически чистые реки. Местность сильно пересечена реками - в основном это притоки Вятки: Люга, Пыжман, Казанка, Бемыжка, Умяк и другими. На юго-западе граница района с Республикой Татарстан проходит по реке Вятке. Родники: «Безек», «Живой ключ» и другие. 
    12)	Глава района – Александр Иванович Плотников. 
    ` },
    { name: 'Воткинский район', coordinates: [Votkinskiy], description: `История
    После Октябрьской революции в 1918 году поднимается вопрос о разделении Сарапульского уезда на более мелкие административные единицы. Во многих волостях проводят опросы населения о тяготении к какому–либо административному центру. Выбор стоял между Ижевском, Воткинском и Сарапулом.
    3 июля 1920 года на заседании Сарапульского окружного исполкома принимается решение разделить Сарапульский уезд на 3 административные единицы: Сарапульский, Ижевский и Воткинский.
    Фактически Воткинский район существует с 1920 года, а в 1926 году утвердились границы муниципальных образований
    Площадь
    186 384 га
    Количество населенных пунктов
    В районе 69 населенных пунктов.
    Численность населения
    Численность населения района на 01 января 2024 года составила 23 474 человека.
    Национальный состав
    Национальный состав населения: русские – 71,9%, удмурты – 22,6%, татары – 2%, другие национальности – 3,5%.
    Административный центр района
    Г. Воткинск
    Плотность населения
    Средняя плотность населения — 12,94 чел./км². Район занимает 8-е место по численности населения и 11-е место по плотности среди муниципальных районов Удмуртии.
    Краткая информация
    Воткинский район с центром в г. Воткинске входит в состав Удмуртской Республики. На севере граничит с Шарканским районом, на северо–востоке с Больше–Cосновским районом Пермского края, на юго–востоке с Чайковским районом Пермского края, на востоке с Частинским районом Пермского края, на западе с Якшур–Бодьинским районом Удмуртской Республики, на юго–западе с Завьяловским районом Удмуртской Республики.
    Ведущими отраслями экономики являются промышленность и сельское хозяйство.
    
    Достопримечательности
    Урочище «Сидоровы горы»
     Конный клуб в селе Светлое 
     Храм  в селе Паздеры 
    Водные объекты
    Реки Кама, Сива с притоками Ольховка, Сидоровка, Пихтовка, Кивара, Мостовка, Воткинское водохранилище
    Глава района
    Васильев Сергей Александрович
    ` },
    { name: 'Киясовский район', coordinates: [Kiyasovskiy], description: `История
    7 февраля 1924 года Президиум Уральского областного исполнительного комитета Советов рабочих, крестьянских и красноармейских депутатов утвердил сеть созданных районов по всем округам Уральской области, в том числе Киясовский район Сарапульского округа. Окончательно Киясовский район в составе Сарапульского округа Уральской области был утвержден Декретом ВЦИК от 4 ноября 1926 года «Об утверждении сети районов Уральской области
    Постановлением ВЦИК от 22 октября 1937 года Киясовский район передан из Кировской области в состав Удмуртской АССР.
    1 февраля 1963 года Киясовский район был ликвидирован, его сельсоветы переданы в Ижевский и Сарапульский сельские районы, но уже 12 января 1965 года восстановлен как самостоятельная территориальная единица.
    В результате муниципальной реформы с 1 января 2006 года наделён статусом муниципального района.
    Площадь
     821,27 км²
    Количество населенных пунктов
    В Киясовский район входят 34 населённых пункта.
    Численность населения
    8792 чел.
    Национальный состав
    По результатам переписи 2020 года, среди населения района русские составляли 62,5 %, удмурты — 30,9 %, татары — 4,9 %. Киясовский район один из 13 сельских районов республики, где русские составляют большинство.
    Административный центр района
    село Киясово.
    Плотность населения
    10,71 чел./км²
    Краткая информация
    Район расположен в южной части республики и граничит с Малопургинским районом на севере, Сарапульским — на востоке и Республикой Татарстан на юге и западе. Район расположен на Сарапульской возвышенности. Киясовский район — сельскохозяйственный. Доля сельскохозяйственного производства составляет 80 % от общего объёма выпускаемой продукции в районе.
    Основными видами деятельности сельскохозяйственных предприятий района являются — производство молока, мяса крупного рогатого скота и свиней, выращивание зерна. Агропромышленный комплекс района представляют 59 предприятий, занятых производством сельскохозяйственной продукции.
    Достопримечательности
    Киясовский районный музей П. А. 
    Лебединый пруд в селе Ильдибаево. 
    Свято-Никольский храм в селе 
    Водные объекты
    Реки — Шихостанка, Медвежинка, Игровка, Крындинка
    Глава района
    Кирющенков Сергей Алексеевич
    ` },
    { name: 'Глазовский район', coordinates: [Glazovskiy], description: `История
    Район был образован 15 июля 1929 года из 22 сельсоветов Глазовской, Ежевской, Понинской, Пудемской и Ягошурской волостей Глазовского уезда. 2 января 1950 года город Глазов получил статус города республиканского (АССР) подчинения. В 1956 году в связи с упразднением Понинского и Пудемского районов в состав Глазовского района переданы часть их сельсоветов. В 1962 году на основе района был сформирован Глазовский сельский район, в состав которого помимо сельсоветов Глазовского района вошли сельсоветы Красногорского, Юкаменского и Ярского районов. В 1965 году ранее упразднённые районы восстановлены и сельский район преобразован в Глазовский район. В результате муниципальной реформы с 1 января 2006 года наделён статусом муниципального района
    Площадь
    2159,7 км²
    Количество населенных пунктов
    В Глазовский район входят 123 населённых пункта.
    Численность населения
    15 775 чел.
    Национальный состав
     Удмурты составляли 55,7 %, русские — 40,3 %, татары — 2,4 %, другие национальности — 1,6 %
    Административный центр района
    Г. Глазов
    Плотность населения
    7,93 чел/км². Район занимает 15-е место по численности населения и 22-е место по плотности среди муниципальных районов Удмуртии.
    Краткая информация
    Район расположен в северной части республики вокруг города Глазов и граничит с Кировской областью на севере, Балезинским районом на востоке, Красногорским районом на юге и Ярским и Юкаменским районами на западе. По центру района с востока на запад протекает река Чепца — крупнейшая река севера Удмуртии. Северная часть района расположена на Верхнекамской возвышенности, а южная — на Красногорской возвышенности[4]. В основном территория района — всхолмлённая равнина. На территории Глазовского района действуют 17 сельскохозяйственных предприятий и 96 фермерских хозяйств, основным направлением сельского хозяйства является мясомолочное животноводство
    Достопримечательности
    Археологический музей-заповедник в Удмуртии – «Иднакар». 
    Историко-культурный парк «ДондыДор
    Курорт «Русская Греция 
    
    
    Водные объекты
     По территории района, помимо Чепцы, протекают её притоки — Пызеп, Убыть, Сепыч, Варыж.
    Глава района
    Терский Владимир Анатольевич
    ` },
    { name: 'Балезинский район', coordinates: [Balezinskiy], description: `История
    Район образован 15 июля 1929 года из 20 сельсоветов Балезинской и Ягошурской волостей Глазовского уезда20 октября 1933 года Президиум ВЦИК постановил «Перечислить Прохоровский сельсовет, Юкаменского района, Удмуртской автономной области, в Балезинский район той же области».27 ноября 1956 года к Балезинскому району присоединили часть территории упразднённого Зуринского района.
    С 1963 по 1965 годы на основе района существовал Балезинский сельский район, в состав которого помимо сельсоветов Балезинского района входили сельсоветы Карсовайского и Красногорского районов..
    В рамках организации местного самоуправления с 2005 до 2021 год функционировал муниципальный район. Законом Удмуртской Республики от 17 мая 2021 года муниципальный район и все входящие в его состав сельские поселения через объединение к 30 мая 2021 года преобразованы в муниципальный округ Балезинский район
    Площадь
    2434,67 км²[
    Количество населенных пунктов
    В Балезинский район входят 136 населённых пунктов.
    Численность населения
    27 261 чел.
    Национальный состав
     Удмурты - 46,1 %, русские — 42,1 %, татары — 9,6 %[
    Административный центр района
    посёлок Балезино.
    Плотность населения
    15 чел/км²
    Краткая информация
    Район расположен в северной части республики и граничит с Глазовским, Красногорским, Игринским и Кезским районами, а также с Кировской областью и Пермским краем на севере. Северная часть района расположена на Верхнекамской возвышенности, южная — на Красногорской возвышенности, а центральную часть пересекает долина Чепцы. Основные направления сельского хозяйства — мясо-молочное животноводстворастениеводство, в районе 19 сельхозорганизаций и 12 крестьянских фермерских хозяйств. 
    Достопримечательности
    Водонапорная башня
    Балезинский историко-краеведческий музей
    Покровский женский монастырь в селе Каменное Заделье
    Водные объекты
     По территории района протекают реки — Чепца, Кеп, Лопья, Кама, Пызеп, Люк, Юнда.
    Глава района
    Новойдарский Юрий Васильевич 
    ` },
    { name: 'Игринский район', coordinates: [Igrinskiy], description: `История
    Район образован 1 июня 1937 года, при разукрупнении Зуринского (Бачкеевский, Вукогуртский, Гереевский, Деменлудский, Игринский и Кузьмоверский с/с, поссовет Сергиевского завода «Факел») и Дебёсского (Русско-Лозинский и Чутырский с/с) районов.
    В годы Великой Отечественной войны Игра становится одной из узловых точек строительства железной дороги Ижевск — Балезино, дорога была построена руками женщин и подростков. Более 4700 игринцев отдали свои жизни, защищая Родину на фронтах Великой Отечественной.27 ноября 1956 года к Игринскому району были присоединены Зуринский, Ключевский, Сепожский, Сепский и Тюптиевский с/с упразднённого Зуринского района.
    В 1963 году на основе района были сформированы Игринский сельский и Игринский промышленный районы, которые существовали до 1965 года, когда район был восстановлен.В рамках организации местного самоуправления с 2005 до 2021 гг. функционировал муниципальный район. Законом Удмуртской Республики от 1 апреля 2021 года, муниципальный район и все входившие в его состав сельские поселения через объединение к 18 апреля 2021 года были преобразованы в муниципальный округ Игринский район[
    
    Площадь
    2266,9 км²
    Количество населенных пунктов
    В Игринский район входят 113 населённых пунктов.
    Численность населения
    33 468 чел.
    Национальный состав
     Удмурты - 49,6 %, русские — 48,2 %, татары — 1 %[
    Административный центр района
    посёлок Игра.
    Плотность населения
    15,71 чел./км²
    Краткая информация
    Район расположен в центральной части республики и граничит с Балезинским, Кезским, Дебёсским, Шарканским, Якшур-Бодьинским, Селтинским и Красногорским районами. 
    Добыча нефти на территории Игринского района началась в 1973 году. Сейчас НГДУ (Нефтегазодобывающее управление) «Игра» является крупнейшим структурным подразделением Удмуртнефти, добывая приблизительно треть всей нефти, добываемой Удмуртнефтью. 
    Достопримечательности
    Храм иконы "Неупиваемая Чаша"
    Памятник Пограничнику
    Церковь св. Митрофана Воронежского, с.Зура
    Водные объекты
     Две главные реки района — Лоза и Ита, являются левыми притоками Чепцы.
    Глава района
    Чирков Александр Владимирович 
    ` },
  ];